; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s5-p9-a4)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 t5 
          l0-0 l0-1 l0-2 l0-3 l0-4 l1-0 l1-1 l1-2 l1-3 l1-4 l2-0 l2-1 l2-2 l2-3 l2-4 l3-0 l3-1 l3-2 l3-3 l3-4 l4-0 l4-1 l4-2 l4-3 l4-4 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l4-4)
    (in-city  l4-4 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (at t0 l0-2)
    (at t1 l1-4)
    (at t2 l2-0)
    (at t3 l3-4)
    (at t4 l4-3)
    (at t5 l0-2)
    (at p0 l4-2)
    (at p1 l4-3)
    (at p2 l1-0)
    (at p3 l1-0)
    (at p4 l1-0)
    (at p5 l0-1)
    (at p6 l0-3)
    (at p7 l3-2)
    (at p8 l3-1)
    (at a0 l3-0)
    (at a1 l0-0)
    (at a2 l0-0)
    (at a3 l1-0)
)
(:goal
    (and
        (at p0 l0-2)
        (at p1 l4-3)
        (at p2 l3-1)
        (at p3 l1-0)
        (at p4 l1-2)
        (at p5 l0-1)
        (at p6 l0-1)
        (at p7 l1-1)
        (at p8 l4-4)
    )
)

  (:constraints
    (and
      (always (not (in p1 a0)))
      (always (not (in p1 a1)))
      (always (not (in p1 a2)))
      (always (not (in p1 a3)))
      (always (not (in p3 a0)))
      (always (not (in p3 a1)))
      (always (not (in p3 a2)))
      (always (not (in p3 a3)))
      (always (not (in p4 a0)))
      (always (not (in p4 a1)))
      (always (not (in p4 a2)))
      (always (not (in p4 a3)))
      (always (not (in p5 a0)))
      (always (not (in p5 a1)))
      (always (not (in p5 a2)))
      (always (not (in p5 a3)))
      (always (not (in p6 a0)))
      (always (not (in p6 a1)))
      (always (not (in p6 a2)))
      (always (not (in p6 a3)))
    )
  )
)

; plan
1. (fly-airplane a3 l1-0 l3-0)
   deleted: (at a3 l1-0)
   added: (at a3 l3-0)
   goals met: 3 of 9
2. (drive-truck t4 l4-3 l4-4 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-4)
   goals met: 3 of 9
3. (drive-truck t3 l3-4 l3-2 c3)
   deleted: (at t3 l3-4)
   added: (at t3 l3-2)
   goals met: 3 of 9
4. (drive-truck t1 l1-4 l1-2 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-2)
   goals met: 3 of 9
5. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 3 of 9
6. (drive-truck t5 l0-2 l0-3 c0)
   deleted: (at t5 l0-2)
   added: (at t5 l0-3)
   goals met: 3 of 9
7. (fly-airplane a1 l0-0 l4-0)
   deleted: (at a1 l0-0)
   added: (at a1 l4-0)
   goals met: 3 of 9
8. (fly-airplane a2 l0-0 l3-0)
   deleted: (at a2 l0-0)
   added: (at a2 l3-0)
   goals met: 3 of 9
9. (load-truck p7 t3 l3-2)
   deleted: (at p7 l3-2)
   added: (in p7 t3)
   goals met: 3 of 9
10. (load-truck p6 t5 l0-3)
   deleted: (at p6 l0-3)
   added: (in p6 t5)
   goals met: 3 of 9
11. (drive-truck t4 l4-4 l4-2 c4)
   deleted: (at t4 l4-4)
   added: (at t4 l4-2)
   goals met: 3 of 9
12. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 3 of 9
13. (fly-airplane a2 l3-0 l1-0)
   deleted: (at a2 l3-0)
   added: (at a2 l1-0)
   goals met: 3 of 9
14. (drive-truck t3 l3-2 l3-1 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-1)
   goals met: 3 of 9
15. (drive-truck t5 l0-3 l0-1 c0)
   deleted: (at t5 l0-3)
   added: (at t5 l0-1)
   goals met: 3 of 9
16. (load-truck p0 t4 l4-2)
   deleted: (at p0 l4-2)
   added: (in p0 t4)
   goals met: 3 of 9
17. (load-truck p4 t1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 3 of 9
18. (load-airplane p2 a2 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a2)
   goals met: 3 of 9
19. (load-truck p8 t3 l3-1)
   deleted: (at p8 l3-1)
   added: (in p8 t3)
   goals met: 3 of 9
20. (unload-truck p6 t5 l0-1)
   deleted: (in p6 t5)
   added: (at p6 l0-1)
   goals met: 4 of 9
21. (drive-truck t4 l4-2 l4-4 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-4)
   goals met: 4 of 9
22. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 4 of 9
23. (fly-airplane a2 l1-0 l3-0)
   deleted: (at a2 l1-0)
   added: (at a2 l3-0)
   goals met: 4 of 9
24. (unload-truck p4 t1 l1-2)
   deleted: (in p4 t1)
   added: (at p4 l1-2)
   goals met: 5 of 9
25. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 5 of 9
26. (drive-truck t4 l4-4 l4-0 c4)
   deleted: (at t4 l4-4)
   added: (at t4 l4-0)
   goals met: 5 of 9
27. (unload-airplane p2 a2 l3-0)
   deleted: (in p2 a2)
   added: (at p2 l3-0)
   goals met: 5 of 9
28. (drive-truck t1 l1-2 l1-1 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-1)
   goals met: 5 of 9
29. (unload-truck p8 t3 l3-0)
   deleted: (in p8 t3)
   added: (at p8 l3-0)
   goals met: 5 of 9
30. (unload-truck p7 t3 l3-0)
   deleted: (in p7 t3)
   added: (at p7 l3-0)
   goals met: 5 of 9
31. (unload-truck p0 t4 l4-0)
   deleted: (in p0 t4)
   added: (at p0 l4-0)
   goals met: 5 of 9
32. (load-truck p2 t3 l3-0)
   deleted: (at p2 l3-0)
   added: (in p2 t3)
   goals met: 5 of 9
33. (load-airplane p8 a0 l3-0)
   deleted: (at p8 l3-0)
   added: (in p8 a0)
   goals met: 5 of 9
34. (load-airplane p7 a0 l3-0)
   deleted: (at p7 l3-0)
   added: (in p7 a0)
   goals met: 5 of 9
35. (load-airplane p0 a1 l4-0)
   deleted: (at p0 l4-0)
   added: (in p0 a1)
   goals met: 5 of 9
36. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 5 of 9
37. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 5 of 9
38. (fly-airplane a0 l3-0 l4-0)
   deleted: (at a0 l3-0)
   added: (at a0 l4-0)
   goals met: 5 of 9
39. (fly-airplane a1 l4-0 l0-0)
   deleted: (at a1 l4-0)
   added: (at a1 l0-0)
   goals met: 5 of 9
40. (unload-truck p2 t3 l3-1)
   deleted: (in p2 t3)
   added: (at p2 l3-1)
   goals met: 6 of 9
41. (unload-airplane p8 a0 l4-0)
   deleted: (in p8 a0)
   added: (at p8 l4-0)
   goals met: 6 of 9
42. (unload-airplane p0 a1 l0-0)
   deleted: (in p0 a1)
   added: (at p0 l0-0)
   goals met: 6 of 9
43. (fly-airplane a0 l4-0 l1-0)
   deleted: (at a0 l4-0)
   added: (at a0 l1-0)
   goals met: 6 of 9
44. (load-truck p8 t4 l4-0)
   deleted: (at p8 l4-0)
   added: (in p8 t4)
   goals met: 6 of 9
45. (load-truck p0 t0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 t0)
   goals met: 6 of 9
46. (drive-truck t4 l4-0 l4-4 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-4)
   goals met: 6 of 9
47. (unload-airplane p7 a0 l1-0)
   deleted: (in p7 a0)
   added: (at p7 l1-0)
   goals met: 6 of 9
48. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 6 of 9
49. (unload-truck p8 t4 l4-4)
   deleted: (in p8 t4)
   added: (at p8 l4-4)
   goals met: 7 of 9
50. (unload-truck p0 t0 l0-2)
   deleted: (in p0 t0)
   added: (at p0 l0-2)
   goals met: 8 of 9
51. (load-truck p7 t1 l1-0)
   deleted: (at p7 l1-0)
   added: (in p7 t1)
   goals met: 8 of 9
52. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 8 of 9
53. (unload-truck p7 t1 l1-1)
   deleted: (in p7 t1)
   added: (at p7 l1-1)
   goals met: 9 of 9
